Enums/ra_SkhemySertifikacii.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ra_SkhemySertifikacii</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>C3_IspytaniyaObrazcovProdukcii</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>C4_IspytaniyaObrazcovProdukcii</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>C5_IspytaniyaObrazcovProdukcii</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>C6_IspytaniyaPartii</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>C7_IspytanieKazhdogoObrazca</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>NePrimenyaetsya</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ra_FormyOcenkiSootvetstviya.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ra_FormyOcenkiSootvetstviya</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>AttestacionnyeIspytaniya</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>EkspertizaTD</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PoryadokObyazatelnojSertifikacii</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>InspekcionnyjKontrol</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Priemka</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ReshenieOPrimeneniiImportnojProdukcii</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Registraciya</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ra_SkhemySertifikacii/Ext/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("НеОтбирать") Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ra_SkhemySertifikacii.Ссылка КАК Ссылка,
		|	ПРЕДСТАВЛЕНИЕ(ra_SkhemySertifikacii.Ссылка) КАК Представление
		|ИЗ
		|	Перечисление.ra_SkhemySertifikacii КАК ra_SkhemySertifikacii
		|%1";
		
		ФормаОС = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Параметры.Отбор, "FormaOS");
		Если ФормаОС <> Неопределено Тогда
			Если ФормаОС = Перечисления.ra_FormyOcenkiSootvetstviya.PoryadokObyazatelnojSertifikacii Тогда
				ТекстЗапросаУсловие = 
				"ГДЕ
				|	ra_SkhemySertifikacii.Ссылка <> ЗНАЧЕНИЕ(Перечисление.ra_SkhemySertifikacii.NePrimenyaetsya)";
			Иначе
				ТекстЗапросаУсловие = 
				"ГДЕ
				|	ra_SkhemySertifikacii.Ссылка = ЗНАЧЕНИЕ(Перечисление.ra_SkhemySertifikacii.NePrimenyaetsya)";
			КонецЕсли;
			ТекстЗапроса = СтрШаблон(ТекстЗапроса, ТекстЗапросаУсловие);
		Иначе
			ТекстЗапроса = СтрШаблон(ТекстЗапроса, "");
		КонецЕсли;
		
		Запрос = Новый Запрос(ТекстЗапроса);				
		
		ДанныеВыбора = Новый СписокЗначений;
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ДанныеВыбора.Добавить(Выборка.Ссылка, Выборка.Представление);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
